app/controllers/application_controller.rb

  def authorize_request
    header = request.headers['Authorization']
    header = header.split(' ').last if header
    begin
      @decode = decode(header)
      @current_user = User.find(@decode[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]