app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "prep_time", "baking_cooking_time", "servings", "directions", "created_at", "updated_at", "ingredients", "user_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user = @current_user

    if @recipe.save

UPDATE "recipes" SET "name" = $1, "prep_time" = $2, "updated_at" = $3 WHERE "recipes"."id" = $4  [["name", "THE Kalamama Martini"], ["prep_time", "15 minutes"], ["updated_at", "2021-06-23 23:49:18.017532"], ["id", 3]]
---
  def update
    if @recipe.update(recipe_params)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def add_category
    @category = Category.find(params[:category_id])